public enum Region {
    CHYI {
        @Override
        public String region() {

            return "Чуйская область занимает северную часть Кыргызской Республики. Граничит на севере и западе с Республикой Казахстан юго-западе — Таласской," +
                           "\n Джалал-Абадской, на юге — Нарынской, на юго-востоке — Иссык-Кульской областями Кыргызской Республики. " +
                           "\nВ состав области входят 8 районов"+"Бишкек – это столица Кыргызстана, расположенная у подножия гор Тянь-Шань в Центральной Азии. Отсюда можно добраться до горных хребтов Ала-Тоо и национального парка Ала-Арча," +
                           "\n известных своими ледниками и дикой природой. Культурные центры города – монументальный Национальный музей искусств и Театр оперы и балета, размещенный в здании с колоннами. На центральной площади Ала-Тоо установлен памятник герою киргизского эпоса Манасу Великодушному" ;
        }
    },
    YSSYKKUL {
        @Override
        public String region() {
            return "Кыргыз элинин бермети – Ысык-Көл. Ал тоо арасында жайгашкан. Анын тарыхта түрлүү аттары сакталып калган. Ысык – Көл жылуу көл дегенди билдирет." +
                    "\n Анын Туз – Көл деген да аты болгон. Андан кийин Тимур – ту – Нор деп да аташкан. Бул темирлүү көл дегенди билдирген. Бир кезде Жыт-Көл деп да аташкан. " +
                    "\nЫсык-Көлдүн мындайча аталышы кокусунан болгон эмес. Ысык-Көл деңиз денгээлинен 1623 метр бийик жерде жайгашкан. Анын аянты 6124 чарчы километрди түзөт. Узундугу 182 километрге чейин жетет, туурасы 60 километрге барабар." +
                    "\n Тереңдиги жагынан дүйнөдөгү Танганьика, Ньяса жана Байкал көлдөрүнөн кийинки төртүнчү орунда турат. Эң терең жери 700 метрден да ашыгыраак. Ысык-Көлгө 80ден ашык агын суу келип кошулат. Ысык-Көлгө жаздын келиши эң кызыктуу болот. Көл үстү түркүн сонундарды элестетет." +
                    "\nЫсык-Көл облусу — Кыргыз Республикасынын чыгыш бөлүгүндө жайгашкан облус. Борбору — Каракол шаары. Курамында 5 район (Ак Суу, Жети Өгүз, Тоң, Түп, Ысык Көл), 3 шаар (Балыкчы, Каракол, Чолпон-Ата) , 5 шаарча (Ак-Булак, Жыргалаң, Кажы-Сай, Прежевальск пристаны, Орто-Токой)" +
                    "\n 57 айыл округу жана 171 айыл бар(2012). Түндүгүнөн жана түндүк-чыгышынан Казакстан, чыгышынан жана түштүк-чыгышынан Кытай, батышынан жана түштүк-батышынан Нарын, түндүк-батышынан Чүй облустары менен чектешет.";
        }
    },
    NARYN{
        @Override
        public String region() {
            return "Нарын облусу Кыргызстандын түштүк-чыгышында жайгашып, 1939-жылдын 21-ноябрында Тянь-Шань облусу болуп негизделген. 1962-жылдын 30-декабрында чачыратылып, анын карамагындагы аймактар республикага баш ийген. Ал эми Нарын облусу болуп 1970-жылдын 11-декабрынла кайра негизделген.\n" +
                    "\n 1988-жылдын 5-октябрында Ысык-Көл облусу менен биригип, 1990-жылдын 14-декарында кайрадан Нарын облусу болуп калган. Облус чыгышынан Ысык-Көл, түндүгүнөн Чүй, батыштан Жалал-Абад жана Ош облустары менен чектешет. Ал эми түштүк жагынан Кытай менен чектеш. Облустун курамына 5 аймак (район) кирет," +
                    "\n алар: Ак-Талаа, Ат-Башы, Жумгал, Кочкор, Нарын райондору.";
        }
    },
    TALAS{
        @Override
        public String region() {
            return "Талас облусу - Кыргызстандын түндүк батыш жагынан орун алган, өлкө ичиндеги территориясы жана калкынын саны жагынан эң аз жана чакан облус. Жалпы аянты 11 400 км², калкынын саны 2011-жылдагы эсеп боюнча 231 800 адамдан турат.  Облустун борбору Талас шаары эң алгач кыштак катары 1877-жылы негизделген. " +
                    "\n Талас 1913-жылга чейин Ак-Чий кыштагы деп аталып, орус бийлигинин орношу менен бул жер Дмитриевка деп өзгөртүлүп, Дмитриевка борбор катары шаар деп белгиленет.  Бирок Талас облусу аймак катары 1944-жылга чейин Чүй облусунун бир бөлүгү катары эсептелинип келген. 1944-жылы СССРдин Жогорку Советинин 22-июндагы чечимине ылайык Кыргыз ССРинин курамында облус катары уюштурулуп, борбору кайрадан мурдагы аталышы Талас шаары болуп аталган. " +
                    "\n  1956-жылы 18-февралда Фрунзе облусуна кошулуп, 1962-жылы бул облус жоюлган соң анын аймагындагы Талас району, Киров (Азыркы Кара-Буура) району жана Ленинполь (Бакай-Ата) району Республикага түз баш ийдирилген.  Аймактык жактан 1980-жылдын 3-сентябрынан тартып 1988-жылдын 5-октябрына чейин азыркы Жалал-Абад облусуна караштуу Токтогул району Талас облусунун курамында болгон. Кыргыз Республикасы Эгемендүү Республика катары жарыяланганы Талас облусунун территориясы башка аймактардын эсебинен өзгөрүлө элек." +
                    "\n Ошондой эле облустун курамына 4 район, 36 айылдык округ, 90 айыл, 1 шаар тибиндеги кыштак кирет.";
        }
    },
    JALALABAT{
        @Override
        public String region() {
            return "Жалал-Абад — Жалал-Абад облусунун борбору (1991-жылдан).\n" +
                    "\n" +
                    "\n1887-жылдан шаар. Чыгарган продукциясынын көлөмү жана өнөр жай потенциалы боюнча Кыргызстанда Бишкек, Оштон кийинки 3-шаар. Көгарт өрөөнүндө, байыркы Улуу Жибек жолунун жана Бишкек-Ош автомобиль жолунун боюнда жайгашкан. Автомобиль жана темир жолдор тоому. Кыргызстандын борбору Бишкек шаарынан 560 км түштүк тарапта; Ош шаарына чейин эл аралык эски жол менен (Өзбекстандын Ханабат шаары аркылуу) 60 км, жаңы жол менен (Өзгөн шаары аркылуу) 100 км. Шаар аянты 8821 га. Калкы 92,1 миң (2009)." +
                    "\n Жалал-Абад шаары 1924-26-жылдарда округдун, 1926-28-жылдарда кантондун, 1939-59-жылы жана 1991-жылдан облустун борбору. Шаар Фергана өрөөнүнүн бир бөлүгүн түзгөн Көгарт өрөөнүнүн түзөң түштүк-чыгыш чет-жакасында, Фергана тоо тизмегинин түштүк-батыш тармагы болгон Айып-Тоонун этегинде, деңиз деңгээлинен 755 мден (түштүк бөлүгүндө) 800 мге чейинки (түндүк бөлүгүндө) бийиктикте жайгашкан. Шаар жайгашкан аймактын рельефи негизинен түздүктүү; түштүк-батышты карай жалпы жантайыңкы." +
                    "\n Мында төртүнчүлүк мезгилде пайда болгон шагылдын үстүн лёсстуу катмар жаап жатат. Жалал-Абад Кыргызстандагы эң жылуу жана күнөстүү шаар. Климаты мелүүн континенттик, жер ортолук деңиздик климатка окшоп кетет. Жайы ысык, кургакчыл, июлдун орточо температурасы 27°С, кышы мелүүн суук, жумшак, январдын орточо температурасы -4,1°С. Жаан-чачындын жылдык орточо өлчөмү 490 мм. Күн тийүү узактыгы жылына 2787 саатты түзөт. Түштүк-батыштан жай соккон (0,6 м/сек) шамал үстөмдүк кылат." +
                    "\n Жалал-Абад шаарынын батыш тарабынан Көгарт, чыгыш тарабынан Чаңгет суулары агып өтөт. Көгарт суусунан ирригациялык көп тармактар башталып, сугат каналдарына таралып кетет. Чаңгеттин суусу сугатка кеңири пайдаланылат. Шаар жайгашкан аймакта жер астындагы суунун запасы да бар.\n" +
                    "\n" +
                    "Суулары\n" +
                    "\n Суу ресурстарынын ичинен маанилүү орунду Айып-Тоонун капталынан чыккан ысык жана минералдык суулар түзөт. Мында 60тан ашык булак бар, алардын 5и ысык (37-42°С), 12си жылуу (20°Сден жогору), калганы муздак булактар. Бул ысык жана минералдык суулардын кендери Орто Азиядагы эң белгилүү Жалал-Абад курортунун (ал шаардан 5 км аралыкта, деңиз деңгээлинен 984 м бийиктикте жайгашкан) дарылоочу базасы болуп саналат. " +
                    "\nКурорттон 2,5 км аралыктагы 27 РЭ көзөнөгүнүн суусу Жалал-Абад пиво заводу тарабынан «Жалал-Абад» № 27 деген ат менен бөтөлкөгө куюлуп, дары-суусундук суу катары соода тармактарына жөнөтүлөт. Курортто минералдуу суулардан сырткары, ошондой эле дары баткак (чым көңдүү) да пайдаланылат. Анын кени шаардан 5 км түштүк -чыгыш тарапта, Айып-Тоонун батыш капталында, деңиз деңгээлинен 1070-1075 м бийиктикте жайгашкан. Шаардын чеги жана Көгарт өрөөнүнүн ага чектеш аймагы жарым чөл жана кургак талаа ландшафттык зоналарында жайгашкан.";
        }
    },
    OSH{
        @Override
        public String region() {
            return "Ош - 3000 жылдык байыркы шаар. Б. з. ч. IV-кылымда – б. з. V-кылымда шаар Чыгыш жана Батыш өлкөлөрүн байланыштырган Улуу Жибек жолундагы маанилүү калаага айланган. 8–10-к. Ош чоңдугу бoюнча Фергана өрөөнүндөгү эң ири шааарлардын бири катары саналган. Шаар дубал менен курчалган жана анын үч дарбазасы; Дарбаза-ий Кух (Тоо дарбазасы), Дарбаза-йи Аб (Суу дарбазасы) жана Дарбаза-йи Мугкеде (Отко сыйынуучулардын ибадатканасы дарбазасы) болгон." +
                    " \n Макдисий 966-жылы жазып бүткөн өзүнүн «Ахсенут-текасим» аттуу эмгегинде «Ош дарыялары мол, ар түрдүү өзгөчөлүктөргө ээ шаар болуп эсептелет. Абасы таза жана молчулук бар. Жамы-мечити базарлардын ортосунда жайгашкан. Тоого жакын бай жер болуп суулары мол. Бул жерде жайгашкан чоң рибатка (аскерий гарнизон жайгашкан жай) ар тараптан көңүлдүү адамдар келишет»-деп шаардагы диний абал жөнүндө да баа жеткис маалыматтарды берет. " +
                    "\n Ош шаарынын 13-к-дын башында [Чыңгыз хан|Чыңгыз хандын]] аскерлери кыйраткан. 13-кылымдын аягы 14-кылымдын башында жашаган Жамал Карший,өзүнүн «ал-Мулхакат бис-сурах» аттуу эмгегинде Ош шаары боюнча төмөнкүдөй маалыматтарды берет: «Ош шаары. Анда эки анча чоң эмес тоо жайгашкан: Баракух жана Ханаф. Баракух тоосунда азиз жана салих адамдардын мазарлары жайгашкан. (Ал жерде) башкалардын катарында Давуддун уулу Сулаймандын вазири Асаф ибн Бурхиянын күмбөзү бар, экөөнө Алланын рахматы болсун»." +
                    "\n 14-к-дын акырында Аксак Темирдин дөөлөтүнө, кийин Моголстанга караган. Моголдор династиясынын негиздөөчүсү Захиреддин Мухаммад Бабур өзүнүн Бабур-Наама деген эмгегинде Ош жана о.эле Сулайман тоонун үстүндөгү чакан үй ж-дө да эскерип кеткен (1496–98). 17-к-да калмактардын кол салуусуна жана талоонуна кириптер болуп турган. 1762-ж. Кокон ханы Эрдене басып алган. Ош тегерегиндеги айылдары менен кошо хандыктын акимдик-аймактык системасында борбордук вилайетке баш ийген бектиктин, 19-к-дын 2-жарымында Ош вилайетинин борбору болгон." +
                    "\n 1876-жылдан Түркстан генерал- 181 губернаторлугунун Фергана облусундагы Ош уездинин борбору болуп калган. 1924-жылдан округдун, 1926- жылдан кантондун, 1928-жылдан райондун, 1939-жылдан облустун борбору. Учурда шаарда орто кылымдын убагында курулган Асаф-Ибн-Бурхиянын мавзолейи (13-к.,) Рават Абдулла хандын мечити (16–17-к.),, Алымбек датканын мечити (19-к.), Мухамад Юсуп Байкожо-оглынын мечити (20-к.) ж. б. 30дан ашык эстеликтер калыбына келтирилген. Ош ш-нда б. з. ч. 4-к.–5-к-га таандык Мырзалимдөбө, Чаяндөбө, Отузадыр байыркы чептери, Мады, Коргошундөбө, Ак-Буура, Шалтакдөбө, Шоробашат, Куршаб, Бөрүдөбө, Дөңбулак, Дыйкан ж. б. чептердин калдыктары сакталган." +
                    "\n 2000-ж-дын октябрь айында Ош шаарынын 3000-жылдык салтанаты белгиленди. Ал тууралуу алгачкы маалыматтар биринчи жолу арап булактарында IX кылымда эскерилген.\n" +
                    "\n Ош шаары Фергана өрөөнүн батышында, деңиз деңгээлинен 1000 метр бийикте жайгашкан. Бишкектен Ошко чейинки автожолдун аралыгы 730 чакырымдай. Калкы 200,5 миң адам. Шаар тургундарынын 43,70% - кыргыздар, 47.60% - өзбектер, калганы - орустар, түрктөр, уйгурлар, татарлар, тажиктер, лөлүлөр жана башка улут өкүлдөрү.\n" +
                    "\n Ош шаары Сулайман-Тоо жана Ак-Буура дарыясы менен атактуу.\n" +
                    "\n Кыргызстандын «экинчи борбору» .\n";
        }
    },
    BATKEN{
        @Override
        public String region() {
            return "Баткен облусу ― Кыргызстандын түштүк-батышында жайгашкан дубан. 1999-жылдын 13- октябрында Ош облусунун Баткен, Кадамжай, Лейлек райондорунун жана Кызыл-Кыя, Сүлүктү шаарларын чек арасында түзүлгөн. Облустун административдик борбору – Баткен шаары (2000-жылдан).\n" +
                    "\n" +
                    "Облустун курамындагы административдик-аймактык бирдиктер:\n" +
                    "\n" +
                    "3 район;\n" +
                    "\n 6 шаар (үчтөн облустук жана райондук маанидеги шаар);\n" +
                    "\n 31 айыл аймагы.\n" +
                    "\n Дубандын түштүк-батыш жана түндүк-батышынан Тажикстан, түндүгүнөн Өзбекстан, чыгышынан Ош облусу менен чектешет. Анын аймагында башка мамлекеттерге тийиштүү бир нече аңкылаптар бар. Ушуга байланыштуу транспорттук катнашы көп чек аралар жана аңкылаптар аркылуу өтөт." +
                    " \nАянты 17,0 миң км² же республиканын айантынын 8,5%ын түзөт. Калкы 548,247 (2021) же республиканын калкынын 8,3 %ын түзөт.\n" +
                    "\n" +
                    "\n 2001-жылы Исфана кыштактары шаар макамын алган. Азыркы учурда Исфана шаары Раззаков деп аталат. 2012-жылы Кадамжай жана Айдаркен шаарчалары шаар макамын алган.";
        }
    };

    public abstract String region();


}

